## Production: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 5 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                             |
|--------|--------------------------------------------------------------|
| add    | `aws_vpc_endpoint.sns`                                       |
| delete | `aws_security_group.lambda_nagware`                          |
|        | `aws_security_group_rule.lambda_nagware_egress_internet`     |
|        | `aws_security_group_rule.lambda_nagware_egress_redis`        |
|        | `aws_security_group_rule.privatelink_lambda_nagware_ingress` |
|        | `aws_security_group_rule.redis_ingress_lambda_nagware`       |
| update | `aws_security_group_rule.forms_redis_ingress`                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_security_group.lambda_nagware will be destroyed
  # (because aws_security_group.lambda_nagware is not in configuration)
  - resource "aws_security_group" "lambda_nagware" {
      - arn                    = "arn:aws:ec2:ca-central-1:957818836222:security-group/sg-05873c4492257f62c" -> null
      - description            = "Lambda Nagware" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Egress to the internet from Nagware Lambda function"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Egress from Nagware Lambda function to Redis"
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0388290614e570375",
                ]
              - self             = false
              - to_port          = 6379
            },
        ] -> null
      - id                     = "sg-05873c4492257f62c" -> null
      - ingress                = [] -> null
      - name                   = "lambda_nagware" -> null
      - owner_id               = "957818836222" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - vpc_id                 = "vpc-0e852a6f3554a8bca" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group_rule.forms_redis_ingress will be updated in-place
  ~ resource "aws_security_group_rule" "forms_redis_ingress" {
      ~ description              = "Security group rule for Forms Database ingress" -> "Security group rule for Forms Redis ingress"
        id                       = "sgrule-4181090906"
        # (11 unchanged attributes hidden)
    }

  # aws_security_group_rule.glue_job_egress_s3 has moved to aws_security_group_rule.glue_job_egress_s3[0]
    resource "aws_security_group_rule" "glue_job_egress_s3" {
        id                     = "sgrule-1849187002"
        # (9 unchanged attributes hidden)
    }

  # aws_security_group_rule.lambda_nagware_egress_internet will be destroyed
  # (because aws_security_group_rule.lambda_nagware_egress_internet is not in configuration)
  - resource "aws_security_group_rule" "lambda_nagware_egress_internet" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Egress to the internet from Nagware Lambda function" -> null
      - from_port              = 443 -> null
      - id                     = "sgrule-1750474527" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-05873c4492257f62c" -> null
      - security_group_rule_id = "sgr-03f8df81d6fe56ca7" -> null
      - self                   = false -> null
      - to_port                = 443 -> null
      - type                   = "egress" -> null
    }

  # aws_security_group_rule.lambda_nagware_egress_redis will be destroyed
  # (because aws_security_group_rule.lambda_nagware_egress_redis is not in configuration)
  - resource "aws_security_group_rule" "lambda_nagware_egress_redis" {
      - description              = "Egress from Nagware Lambda function to Redis" -> null
      - from_port                = 6379 -> null
      - id                       = "sgrule-1135307429" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-05873c4492257f62c" -> null
      - security_group_rule_id   = "sgr-054394669fa207e0a" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0388290614e570375" -> null
      - to_port                  = 6379 -> null
      - type                     = "egress" -> null
    }

  # aws_security_group_rule.privatelink_lambda_nagware_ingress will be destroyed
  # (because aws_security_group_rule.privatelink_lambda_nagware_ingress is not in configuration)
  - resource "aws_security_group_rule" "privatelink_lambda_nagware_ingress" {
      - description              = "Security group rule for Nagware Lambda function ingress" -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-4130882461" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0799d12ff9d17bded" -> null
      - security_group_rule_id   = "sgr-0458f3914f6724478" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-05873c4492257f62c" -> null
      - to_port                  = 443 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.redis_ingress_lambda_nagware will be destroyed
  # (because aws_security_group_rule.redis_ingress_lambda_nagware is not in configuration)
  - resource "aws_security_group_rule" "redis_ingress_lambda_nagware" {
      - description              = "Ingress to Redis from Nagware Lambda function" -> null
      - from_port                = 6379 -> null
      - id                       = "sgrule-3921327658" -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0388290614e570375" -> null
      - security_group_rule_id   = "sgr-0d8169a33dfc752d4" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-05873c4492257f62c" -> null
      - to_port                  = 6379 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.s3_gateway_connector_db_egress has moved to aws_security_group_rule.s3_gateway_connector_db_egress[0]
    resource "aws_security_group_rule" "s3_gateway_connector_db_egress" {
        id                     = "sgrule-2284281472"
        # (9 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.sns will be created
  + resource "aws_vpc_endpoint" "sns" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0799d12ff9d17bded",
        ]
      + service_name          = "com.amazonaws.ca-central-1.sns"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-025adc92b0ee815ba",
          + "subnet-05b9cd59ad60e88af",
          + "subnet-066cf27132a20a02a",
        ]
      + tags_all              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0e852a6f3554a8bca"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

Plan: 1 to add, 1 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_security_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.forms_natgw[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_flow_log.vpc_flow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.forms[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_private_subnet[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.forms_public_subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api_ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.connector_db"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_database"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_egress"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_load_balancer"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.forms_redis"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.glue_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_db"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.idp_ecs"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
